## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 98 to add, 0 to change, 98 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_storage_account.sa




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azuread_group_member.members["Contributor-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "5cd4570c-c9eb-4892-b368-f23a96f16cb5/member/11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> (known after apply)
      ~ member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> "1a4bada3-4107-47e4-a5d7-aa66a580369a" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "6de4c526-e29d-43bf-829a-f45eb30aefbc/member/11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> (known after apply)
      ~ member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> "1a4bada3-4107-47e4-a5d7-aa66a580369a" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Backup",
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "Recover",
                  - "Restore",
                  - "SetIssuers",
                  - "Update",
                ]
              - key_permissions         = [
                  - "Backup",
                  - "Create",
                  - "Decrypt",
                  - "Delete",
                  - "Encrypt",
                  - "Get",
                  - "Import",
                  - "List",
                  - "Recover",
                  - "Restore",
                  - "Sign",
                  - "UnwrapKey",
                  - "Update",
                  - "Verify",
                  - "WrapKey",
                ]
              - object_id               = "5cd4570c-c9eb-4892-b368-f23a96f16cb5"
              - secret_permissions      = [
                  - "Get",
                  - "Set",
                  - "List",
                  - "Delete",
                  - "Restore",
                  - "Recover",
                  - "Backup",
                ]
              - storage_permissions     = [
                  - "Backup",
                  - "Delete",
                  - "DeleteSAS",
                  - "Get",
                  - "GetSAS",
                  - "List",
                  - "ListSAS",
                  - "Recover",
                  - "RegenerateKey",
                  - "Restore",
                  - "Set",
                  - "SetSAS",
                  - "Update",
                ]
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "4efef956-d3fa-487a-996e-5d9c0cdc3f7b"
              - secret_permissions      = [
                  - "List",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "0ec60e03-4262-44ce-abcf-83e2131c9207"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Get",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply)
        name                            = "cef8dd15315775bcde240kv"
      ~ resource_group_name             = "azure-control-dev-rg" -> "azure-control-prod-rg" # forces replacement
      ~ tags                            = {
          ~ "criticality"  = "Low" -> "High"
          ~ "environment"  = "development" -> "production"
            # (3 unchanged elements hidden)
        }
      ~ vault_uri                       = "https://cef8dd15315775bcde240kv.vault.azure.net/" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ network_acls {
          ~ bypass                     = "AzureServices" -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_access_policy.permissions must be replaced
-/+ resource "azurerm_key_vault_access_policy" "permissions" {
      ~ id                      = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/objectId/5cd4570c-c9eb-4892-b368-f23a96f16cb5" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.aks_admin_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      ~ id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/aks-admin-rbac-group-id/3e5a240a410b4a8bba2fbc7ace58cf9f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        name                    = "aks-admin-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/aks-admin-rbac-group-id/versions/3e5a240a410b4a8bba2fbc7ace58cf9f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/aks-admin-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "3e5a240a410b4a8bba2fbc7ace58cf9f" -> (known after apply)
      ~ versionless_id          = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/aks-admin-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.aks_user_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_user_group_id" {
      ~ id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/aks-user-rbac-group-id/12f2993bab694f3d96231e620cf22dfc" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        name                    = "aks-user-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/aks-user-rbac-group-id/versions/12f2993bab694f3d96231e620cf22dfc" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/aks-user-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "12f2993bab694f3d96231e620cf22dfc" -> (known after apply)
      ~ versionless_id          = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/aks-user-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_app_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_app_id" {
      ~ id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-application-id/abf50ce2af7c4011a528588a2788bc83" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        name                    = "sp-application-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-application-id/versions/abf50ce2af7c4011a528588a2788bc83" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-application-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "abf50ce2af7c4011a528588a2788bc83" -> (known after apply)
      ~ versionless_id          = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-application-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_object_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_object_id" {
      ~ id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-object-id/03cd085567e24864bd3ab89cf7d5c830" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        name                    = "sp-object-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-object-id/versions/03cd085567e24864bd3ab89cf7d5c830" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-object-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "03cd085567e24864bd3ab89cf7d5c830" -> (known after apply)
      ~ versionless_id          = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-object-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_token must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_token" {
      - content_type            = "" -> null
      ~ id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-token/4baca53cd1ff4f0e8f6593222906b7dc" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
        name                    = "sp-token"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-token/versions/4baca53cd1ff4f0e8f6593222906b7dc" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/secrets/sp-token" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4baca53cd1ff4f0e8f6593222906b7dc" -> (known after apply)
      ~ versionless_id          = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-token" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv/providers/Microsoft.Authorization/roleAssignments/4f908ba0-1614-c5eb-579b-3327bd912981" -> (known after apply)
      ~ name                             = "4f908ba0-1614-c5eb-579b-3327bd912981" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/f25e0fa2-a7c8-4377-a976-54943a77a395" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/cef8dd15315775bcde240kv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa/providers/Microsoft.Authorization/roleAssignments/4a2be566-a88d-9d58-3783-e979627a8926" -> (known after apply)
      ~ name                             = "4a2be566-a88d-9d58-3783-e979627a8926" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa/providers/Microsoft.Authorization/roleAssignments/b7396b22-d6b7-0a6e-830b-a6696d4c6104" -> (known after apply)
      ~ name                             = "b7396b22-d6b7-0a6e-830b-a6696d4c6104" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleAssignments/7971c7fc-d3fd-44cc-a0e3-b0f9e3accbc2" -> (known after apply)
      ~ name                             = "7971c7fc-d3fd-44cc-a0e3-b0f9e3accbc2" -> (known after apply)
      ~ principal_id                     = "11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> "1a4bada3-4107-47e4-a5d7-aa66a580369a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_storage_account.sa must be replaced
-/+ resource "azurerm_storage_account" "sa" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/cef8dd15315775bcde240sa" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "cef8dd15315775bcde240sa"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://cef8dd15315775bcde240sa.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "cef8dd15315775bcde240sa.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://cef8dd15315775bcde240sa.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "cef8dd15315775bcde240sa.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://cef8dd15315775bcde240sa.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "cef8dd15315775bcde240sa.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://cef8dd15315775bcde240sa.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "cef8dd15315775bcde240sa.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://cef8dd15315775bcde240sa.table.core.windo

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

e-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/objectId/165f68dc-4fcc-4f1b-a9af-be5842bccba3" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_key_vault_secret.aks_admin_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      ~ id                      = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/aks-admin-rbac-group-id/cef01819c186440f8ba01e5499ebd33b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        name                    = "aks-admin-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/aks-admin-rbac-group-id/versions/cef01819c186440f8ba01e5499ebd33b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/aks-admin-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "cef01819c186440f8ba01e5499ebd33b" -> (known after apply)
      ~ versionless_id          = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/aks-admin-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_key_vault_secret.aks_user_group_id must be replaced
-/+ resource "azurerm_key_vault_secret" "aks_user_group_id" {
      ~ id                      = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/aks-user-rbac-group-id/d63f7e994822413e915a53533914bc5b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        name                    = "aks-user-rbac-group-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/aks-user-rbac-group-id/versions/d63f7e994822413e915a53533914bc5b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/aks-user-rbac-group-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d63f7e994822413e915a53533914bc5b" -> (known after apply)
      ~ versionless_id          = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/aks-user-rbac-group-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_key_vault_secret.sp_app_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_app_id" {
      ~ id                      = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-application-id/8d99fc03bb7f49e09b48a8d825fd58c2" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        name                    = "sp-application-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-application-id/versions/8d99fc03bb7f49e09b48a8d825fd58c2" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-application-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "8d99fc03bb7f49e09b48a8d825fd58c2" -> (known after apply)
      ~ versionless_id          = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-application-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_key_vault_secret.sp_object_id must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_object_id" {
      ~ id                      = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-object-id/7ca4eae430784e2aa6fbbe7002e0ab59" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        name                    = "sp-object-id"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-object-id/versions/7ca4eae430784e2aa6fbbe7002e0ab59" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-object-id" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "7ca4eae430784e2aa6fbbe7002e0ab59" -> (known after apply)
      ~ versionless_id          = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-object-id" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_key_vault_secret.sp_token must be replaced
-/+ resource "azurerm_key_vault_secret" "sp_token" {
      - content_type            = "" -> null
      ~ id                      = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-token/9f03dbffe160426e83c12585d4cc311f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
        name                    = "sp-token"
      ~ resource_id             = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-token/versions/9f03dbffe160426e83c12585d4cc311f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/secrets/sp-token" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "9f03dbffe160426e83c12585d4cc311f" -> (known after apply)
      ~ versionless_id          = "https://c4c335e3af2816853a22akv.vault.azure.net/secrets/sp-token" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv/providers/Microsoft.Authorization/roleAssignments/d6e192cf-bed9-43f4-8eb9-3bce889162d4" -> (known after apply)
      ~ name                             = "d6e192cf-bed9-43f4-8eb9-3bce889162d4" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/f25e0fa2-a7c8-4377-a976-54943a77a395" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c4c335e3af2816853a22akv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c4c335e3af2816853a22asa/providers/Microsoft.Authorization/roleAssignments/a32b30c9-7b75-312c-78d1-0d2103d73c2d" -> (known after apply)
      ~ name                             = "a32b30c9-7b75-312c-78d1-0d2103d73c2d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c4c335e3af2816853a22asa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c4c335e3af2816853a22asa/providers/Microsoft.Authorization/roleAssignments/7e70a8ed-518e-1d63-43b1-3e0be15c7772" -> (known after apply)
      ~ name                             = "7e70a8ed-518e-1d63-43b1-3e0be15c7772" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c4c335e3af2816853a22asa" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] must be replaced
-/+ resource "azurerm_role_assignment" "local_role_assignments" {
      ~ id                               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleAssignments/fa76b392-b6fb-a7f4-17e6-7b9722ad6021" -> (known after apply)
      ~ name                             = "fa76b392-b6fb-a7f4-17e6-7b9722ad6021" -> (known after apply)
      ~ principal_id                     = "11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> "1a4bada3-4107-47e4-a5d7-aa66a580369a" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_storage_account.sa must be replaced
-/+ resource "azurerm_storage_account" "sa" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c4c335e3af2816853a22asa" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "c4c335e3af2816853a22asa"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://c4c335e3af2816853a22asa.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "c4c335e3af2816853a22asa.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://c4c335e3af2816853a22asa.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "c4c335e3af2816853a22asa.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://c4c335e3af2816853a22asa.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "c4c335e3af2816853a22asa.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://c4c335e3af2816853a22asa.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "c4c335e3af2816853a22asa.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://c4c335e3af2816853a22asa.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "c4c335e3af2816853a22asa.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://c4c335e3af2816853a22asa.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "c4c335e3af2816853a22asa.z33.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "azure-control-dev-rg" -> "azure-control-prod-rg" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      ~ tags                              = {
          ~ "criticality"  = "Low" -> "High"
          ~ "environment"  = "development" -> "production"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 98 to add, 0 to change, 98 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_group.groups["Owner"] has changed
  ~ resource "azuread_group" "groups" {
        id                         = "8a1b3ca7-e5fe-446c-9a24-5742edde650e"
      ~ members                    = [
          + "69eb3193-44e2-4277-8376-c1e185f00765",
            # (1 unchanged element hidden)
        ]
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":58,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->